# -*- coding: utf-8 -*-

class StellarKnights < DiceBot
  # ダイスボットで使用するコマンドを配列で列挙する
  setPrefixes(['TT', 'STA', 'STB', 'STB2', 'STC', 'ALLS'])

  def initialize
    super

    @d66Type = 1
  end

  def gameName
    '銀剣のステラナイツ'
  end

  def gameType
    "StellarKnights"
  end

  def getHelpMessage
    return <<MESSAGETEXT
・基本
TT：お題表
STA ：シチュエーション表A：時間 (Situation Table A)
STB ：シチュエーション表B：場所 (ST B)
STB2：シチュエーション表B その2：学園編 (ST B 2)
STC ：シチュエーション表C：話題 (ST C)
ALLS ：シチュエーション表全てを一括で（学園編除く）
GAT：所属組織決定 (Gakuen Table)
HOT：希望表 (Hope Table)
DET：絶望表 (Despair Table)
WIT：願い事表 (Wish Table)
YST：あなたの物語表 (Your Story Table)
YSTA：あなたの物語表（異世界） (YST Another World)
PET：性格表 (Personality Table)
    性格表を2回振り、性格を決定する

・霧と桜のマルジナリア
YSTM：あなたの物語表：マルジナリア世界 (YST Marginalia)
STM：シチュエーション表：マルジナリア世界 (ST Marginalia)
YSTL：あなたの物語表：手紙世界 (YST Letter)
YSTR：あなたの物語表：リコレクト・ドール (YST Recollect-doll)
STBR：シチュエーション表B：場所（リコレクト・ドール） (ST B Recollect-doll)
STCR：シチュエーション表C：リコレクト (ST C Recollect)
STE：シチュエーション表：イクリプス専用 (ST Eclipse)

・紫弾のオルトリヴート
FT：フラグメント表 (Fragment Table)
    フラグメント表を５回振る
FTx：フラグメント表をx回振る
YSTB：あなたの物語表：ブリンガー (YST Bringer)
YSTF：あなたの物語表：フォージ (YST Forge)
STAL：シチュエーション表：オルトリヴート (ST Alt-Levoot)
MESSAGETEXT
  end

  def rollDiceCommand(command)
    command = command.upcase

    return analyzeDiceCommandResultMethod(command)
  end

  def getThemeTableDiceCommandResult(command)
    return unless command == "TT"

    tableName = "お題表"
    table = %w{
      未来 占い 遠雷 恋心 歯磨き 鏡
      過去 キス ささやき声 黒い感情 だっこ 青空
      童話 決意 風の音 愛情 寝顔 鎖
      ふたりの秘密 アクシデント！ 小鳥の鳴き声 笑顔 食事 宝石
      思い出 うとうと 鼓動 嫉妬 ベッド 泥
      恋の話 デート ため息 内緒話 お風呂 小さな傷
    }

    text, index = get_table_by_d66(table)

    result = "#{tableName}(#{index}) ＞ #{text}"
    return result
  end

  def getSituationTableDiceCommandResult(command)
    return unless command == "STA"

    tableName = "シチュエーション表A：時間"
    table = %w{
      朝、誰もいない
      騒がしい昼間の
      寂しい夕暮れの横たわる
      星の瞬く夜、
      静謐の夜更けに包まれた
      夜明け前の
    }
    text, index = get_table_by_1d6(table)

    result = "#{tableName}(#{index}) ＞ #{text}"
    return result
  end

  def getPlageTableDiceCommandResult(command)
    return unless command == "STB"

    tableName = "シチュエーション表B：場所"

    table_1_2 = [
      "教室 　小道具：窓、机、筆記用具、チョークと黒板、窓の外から聞こえる部活動の声",
      "カフェテラス　小道具：珈琲、紅茶、お砂糖とミルク、こちらに手を振っている学友",
      "学園の中庭　小道具：花壇、鳥籠めいたエクステリア、微かに聴こえる鳥の囁き",
      "音楽室　小道具：楽器、楽譜、足踏みオルガン、壁に掛けられた音楽家の肖像画",
      "図書館　小道具：高い天井、天井に迫る程の本棚、無数に収められた本",
      "渡り廊下　小道具：空に届きそうな高さ、遠くに別の学園が見える、隣を飛び過ぎて行く鳥",
    ]

    table_3_4 = [
      "花の咲き誇る温室　小道具：むせ返るような花の香り、咲き誇る花々、ガラス越しの陽光",
      "アンティークショップ　小道具：アクセサリーから置物まで、見慣れない古い機械は地球時代のもの？",
      "ショッピングモール　小道具：西欧の街並みを思わせるショッピングモール、衣類に食事、お茶屋さんも",
      "モノレール　小道具：車窓から覗くアーセルトレイの街並み、乗客はあなたたちだけ",
      "遊歩道　小道具：等間隔に並ぶ街路樹、レンガ造りの街並み、微かに小鳥のさえずり",
      "おしゃれなレストラン　小道具：おいしいごはん、おしゃれな雰囲気、ゆったりと流れる時間",
    ]
    table_5_6 = [
      "何処ともしれない暗がり　小道具：薄暗がりの中、微かに見えるのは互いの表情くらい",
      "寂れた喫茶店　小道具：姿を見せないマスター、その孫娘が持ってくる珈琲、静かなひととき",
      "階段の下、秘密のお茶会　小道具：知る人ぞ知る階段下スペースのお茶会、今日はあなたたちだけ",
      "学生寮の廊下　小道具：滅多に人とすれ違わない学生寮の廊下、窓の外には中庭が見える",
      "ふたりの部屋　小道具：パートナーと共に暮らすあなたの部屋、内装や小物はお気に召すまま",
      "願いの決闘場　小道具：決闘の場、ステラナイトたちの花章が咲き誇る場所",
    ]

    table = [table_1_2, table_1_2,
             table_3_4, table_3_4,
             table_5_6, table_5_6,].flatten

    text, index = get_table_by_d66(table)

    result = "#{tableName}(#{index}) ＞ #{text}"
    return result
  end

  def getSchoolTableDiceCommandResult(command)
    return unless command == "STB2"

    tables =
      [
        {:tableName => "アーセルトレイ公立大学",
         :table => %w{
           地下のだだっぴろい学食
           パンの種類が豊富な購買の前
           本当は進入禁止の屋上
           キャンプ部が手入れしている中庭
           共用の広いグラウンド
           使い古された教室
         }},

        {:tableName => "イデアグロリア芸術総合大学",
         :table => %w{
           （美術ｏｒ音楽）準備室
           美しく整備された中庭
           音楽室
           格調高いカフェテラス
           誰もいない大型劇場
           完璧な調和を感じる温室
         }},

        {:tableName => "シトラ女学院",
         :table => %w{
           中庭の神殿めいた温室
           質素だが美しい会食室
           天井まで届く本棚の並ぶ図書館
           誰もいない学習室
           寮生たちの秘密のお茶会室
           寮の廊下
         }},

        {:tableName => "フィロソフィア大学",
         :table => %w{
           遠く聞こえる爆発音
           学生のアンケート調査を受ける
           空から降ってくるドローン
           膨大な蔵書を備えた閉架書庫
           鳴らすと留年するという小さな鐘の前
           木漏れ日のあたたかな森
         }},

        {:tableName => "聖アージェティア学園",
         :table => %w{
           おしゃれなカフェテラス
           小さなプラネタリウム
           ローマの神殿めいた屋内プール
           誰もいない講堂
           謎のおしゃれな空き部屋
           花々の咲き乱れる温室
         }},

        {:tableName => "スポーン・オブ・アーセルトレイ",
         :table => %w{
           人気のない教室
           歴代の寄せ書きの刻まれた校門前
           珍しく人気のない学食
           鍵の外れっぱなしの屋上
           校舎裏
           外周環状道路へ繋がる橋
         }},
      ]

    result = ''

    tables.each_with_index do |table, i|
      tableName = table[:tableName]
      table = table[:table]

      text, index = get_table_by_1d6(table)

      result += "\n" unless i == 0
      result += "#{tableName}(#{index}) ＞ #{text}"
    end

    return result
  end

  def getTpicTableDiceCommandResult(command)
    return unless command == "STC"

    tableName = "シチュエーション表C：話題"

    table_1_3 = [
      "未来の話：決闘を勝ち抜いたら、あるいは負けてしまったら……未来のふたりはどうなるのだろう。",
      "衣服の話：冴えない服を着たりしていないか？　あるいはハイセンス過ぎたりしないだろうか。よぉし、私が選んであげよう!!",
      "ステラバトルの話：世界の未来は私たちにかかっている。頭では分かっていても、まだ感情が追いつかないな……。",
      "おいしいごはんの話：おいしいごはんは正義。１００年前も６４０５年前も異世界だろうと、きっと変わらない真理なのだ。おかわり！",
      "家族の話：生徒たちは寮生活が多い。離れて暮らす家族は、どんな人たちなのか。いつかご挨拶に行きたいと言い出したりしても良いだろう。",
      "次の週末の話：週末、何をしますか？　願いをかけた決闘の合間、日常のひとときも、きっと大切な時間に違いない。",
    ]

    table_4_6 = [
      "好きな人の話：……好きな人、いるんですか？　これはきっと真剣な話。他の何よりも重要な話だ。",
      "子供の頃の話：ちいさな頃、パートナーはどんな子供だったのだろうか。どんな遊びをしたのだろうか。",
      "好きなタイプの話：パートナーはどんな人が好みなのでしょうか……。気になります、えぇ。",
      "思い出話：ふたりの思い出、あるいは出会う前の思い出の話。",
      "願いの話：叶えたい願いがあるからこそ、ふたりは出会った。この戦いに勝利したら、どんな形で願いを叶えるのだろうか。",
      "ねぇ、あの子誰？：この前見かけたパートナーと一緒にいた子。あの子誰？だーれー!?　むー!!"
    ]

    table = [table_1_3, table_1_3, table_1_3,
             table_4_6, table_4_6, table_4_6, ].flatten

    text, index = get_table_by_d66(table)

    result = "#{tableName}(#{index}) ＞ #{text}"
    return result
  end

  def getAllSituationTableDiceCommandResult(command)
    return unless command == "ALLS"

    commands = ['STA', 'STB', 'STC']

    result = ""

    commands.each_with_index do |cmd, i|
      result += "\n" unless i == 0
      result += analyzeDiceCommandResultMethod(cmd)
    end

    return result
  end

  TABLES = {
    'GAT' => {

    }
  }

  GAKUEN_TABLE = [
    "アーセルトレイ公立大学",
    "イデアグロリア芸術総合大学",
    "シトラ女学院",
    "フィロソフィア大学",
    "聖アージェティア学園",
    "スポーン・オブ・アーセルトレイ",
  ].freeze

  HOPE_TABLE_1_TO_3 = %w{
    より良き世界:世界はもっとステキになる。きっと、ずっと、もっと。
    まだまだ物足りない:もっと上へ、もっと強く、あなたの未来は輝いている。
    立ち止まっている暇はない!:止まっている時間がもったいない。もっともっと世界を駆けるのだ!
    私が守るよ:君を傷つける全てから、私が絶対守ってあげる。
    未来は希望に満ちている:生きていないと、素敵なことは起きないんだ!
    慈愛の手:届く限り、あなたは手を差し伸べ続ける。
  }.freeze

  HOPE_TABLE_4_TO_6 = %w{
    自分を犠牲にしてでも:世界はもっときらきらしているんだよ。それを伝える為に、あなたは自分すら犠牲にする。
    右手を伸ばす:救いたいもの、助けたいもの、大事なもの、なにひとつ見捨てるつもりはない!
    無限の愛:愛を注ごう。この胸に溢れんばかりのこの愛を!
    あなたを王に:絶望を知ったパートナーこそ、世界の王に相応しい。私があなたを王にする!
    救世主:私はきっと、世界を救える。誰だって、救ってみせる。
    大好きな人のために!:世界は希望に満ちている。あなたをもっと幸せにしたいの!
  }.freeze

  HOPE_TABLE = [
    HOPE_TABLE_1_TO_3,
    HOPE_TABLE_1_TO_3,
    HOPE_TABLE_1_TO_3,
    HOPE_TABLE_4_TO_6,
    HOPE_TABLE_4_TO_6,
    HOPE_TABLE_4_TO_6,
  ].freeze

  DESPAIR_TABLE_1_TO_3 = %w{
    理不尽なる世界:あなたは世界が如何に理不尽であるか思い知った。
    この手は届かない:あなたにも目標はあった。しかし、もうこの手は届かないのだ。
    停滞した世界:どんなにあがこうと、世界は変わらない。この絶望は救われない。
    どうして僕をいじめるの:あなたは虐げられて生きてきた。守ってくれる者など、どこにもいなかった。
    過去は絶望に満ちている:ずっとずっと、悪いことばかり、辛いことばかりだった。
    周囲の視線:世界があなたを見る目は、限りなく冷たいものだった。
  }.freeze

  DESPAIR_TABLE_4_TO_6 = %w{
    大事故:それは壮絶な事故、いいや、それは事故なんて優しいものですらなかった。
    目の前で消えたモノ:あなたの目の前で、大切なものは消えてしまった。
    喪失:何よりも大事にしていたものは、もう二度と、この手には戻らない。
    没落:あなたか、あなたの親か、ともかくあなたはかつての栄華を一瞬にして失った。
    救いはない:底の底へと沈んでしまった。もう、誰も、俺を救ってくれる人は……。
    偽物だった:あなたは幸せだった。そう思っていた。でもそれは全て作り物で、あなたは騙されていたのだ。
  }.freeze

  DESPAIR_TABLE = [
    DESPAIR_TABLE_1_TO_3,
    DESPAIR_TABLE_1_TO_3,
    DESPAIR_TABLE_1_TO_3,
    DESPAIR_TABLE_4_TO_6,
    DESPAIR_TABLE_4_TO_6,
    DESPAIR_TABLE_4_TO_6,
  ].freeze

  YOUR_STORY_TABLE_1_2 = [
    "熟練ステラナイト:あなたは既に何度もステラバトルを征してきた熟練者で ある。【勲章:3~7の間の好きな値】【歪みの共鳴:1】",
    "権力者の血筋:統治政府や企業の上層部、あるいは学園組織の運営者の家系である。",
    "天才:あなたは紛うことなき天才だ。",
    "天涯孤独:あなたに両親はいない。促成培養槽で造られた者なのか、あるいは両親を失ったのか……。",
    "救いの手:あなたは誰かに助けてもらった。だから、ここにいるのだ。",
    "欠損:心や身体、大切な宝物、家族、あなたは何かを失って、そのまま今に 至った。",
  ].freeze

  YOUR_STORY_TABLE_3_4 = [
    "大切なもの:大事にしているものがある。",
    "お気に入りの場所:好きな場所がある。秘密の場所、あるいは誰かと来たい場所。",
    "メイドorバトラー:あなたには仕えるべき相手がいる。金銭の関係か、家柄か、恩義故かは自由に決めて良い。",
    "パートナー大好き!!!!!!:私はー!! パートナーがー!! 大好きだー!!!",
    "目指せ理想のタイプ:パートナーの理想のタイプ目指してー、ファイトー!!",
    "世界への不満:こんな世界はダメダメだ! 私が絶対に創り変えてやる!!",
  ].freeze

  YOUR_STORY_TABLE_5_6 = [
    "停滞:何もかもがつまらない。満たされない。動かない世界に嫌気が差して いる。",
    "願いの奴隷:願いを叶える為なら、手段は選ばない。願いの為だけに私は生 きている。",
    "犯罪者の子:あなたの親は何らかの犯罪に手を染めた。その悪評は、子である君にも影響を及ぼしている。",
    "探求者:世界の真実、隠された真実、万物の真理……あなたが追い求めるものはどこまでも尽きない。",
    "正義:困った人を見捨てられない、悪は許せない、この胸に宿るのは正義の心。",
    "誓約生徒会(カヴェナンター):あなたは一度、エクリプスと化し、討伐さ 6 れた者だ。しかし願いを諦めることは出来ない。だから、あなたはこの仮面を受け取り、戦い続けているのだ。【勲章:0~5の間の好きな値】【歪みの共鳴:0~2の間の好きな値】",
  ].freeze

  YOUR_STORY_TABLE = [
    YOUR_STORY_TABLE_1_2,
    YOUR_STORY_TABLE_1_2,
    YOUR_STORY_TABLE_3_4,
    YOUR_STORY_TABLE_3_4,
    YOUR_STORY_TABLE_5_6,
    YOUR_STORY_TABLE_5_6,
  ].freeze

  YOUR_STORY_TABLE_ANOTHER_WORLD_1_2 = [
    "終わりなき戦場:あなたは果ての見えない戦場の世界からここへ流れ着いた。",
    "滅びの世界:戦争、あるいは環境汚染か、滅びた後の世界から、あなたはここへ流れ着いた。",
    "獣人たちの世界:人とは、獣の特徴を備えた者を指す言葉だった―― あなたの世界では。あなたは獣の特徴を備えており、それはアーセルトレイでは奇異の目で見られることだろう。",
    "箱庭の世界:都市か、屋敷か、あなたの住んでいた世界は極狭いものだった。大好きな姉妹や家族と、ただ平穏に暮らすだけの日々。永遠に続くと思っていたそれは、ある日突然に崩壊して、あなたはこの世界へと辿り着いた。",
    "永遠なる迷宮の世界:無限に広がる迷宮の世界、人々はそこを旅する探索者だった。旧世界の遺産とも称される星まるごとが迷宮の世界、心躍る冒険―― そんな日々は、ある日突然に終わってしまった。あなたが辿り着いたのは、アーセルトレイと呼ばれるこの場所だった。",
    "巡礼者の世界:広大な自然と石造りの都の世界を、誰もが旅をし続ける世界からあなたはここへ流れ着いた。アーセルトレイに存在する文明は、どれもあなたにとって未知のものだろう。だが、広大なるあの世界へ、戻ることはもう出来ないのだ。",
  ].freeze

  YOUR_STORY_TABLE_ANOTHER_WORLD_3_4 = [
    "永遠のヴィクトリア:200年にわたるヴィクトリア女王の統治が続く常闇の世界。蒸気の霧が街を覆い、夜な夜な怪人が闊歩する世界から、あなたはここへ流れ着いた。あなたからすれば、ここは平和な世界だ。しかし、ステラバトルの願いがぶつかる華やかさだけは、あの頃を思い出させる。",
    "剣撃乱舞する世界:我々からすれば戦国と呼ばれた極東の一時代を、永遠に繰り返していた世界からあなたはここへ流れ着いた。あなたの剣技は、ステラバトルを切り抜けるのに十分に役立つことだろう。",
    "薄暗き森の世界:広大にして永遠に続く森に包まれた世界、霧と風、獣の鳴き声に満ちた世界から、あなたはここへ流れ着いた。あなたの姿を見て、エルフだとか、妖精だとか呼ぶものもいるかもしれないが、あなたには関係のないことだ。",
    "人類の瀬戸際:ここも、故郷も、大して変わらない。あなたの故郷は、地球に先んじてロアテラに滅ぼされた世界だ。ここを守護することに躊躇いはない。しかしそれよりも、あなたにとってはここで出会った唯一のパートナーの方が大切なのだ。",
    "人形劇の世界:あなたの世界に生きる人々は、元々は人間と呼ばれていたらしい。全ての住人が人形と化したあなたの故郷は、それなりに平和で、楽しいものだったはずだ。しかしそんな日々は、ある日突然終わってしまった。人形そのものであるあなたの姿は、時に奇異の目で見られることだろう。",
    "怪獣迎撃の世界:巨大な怪獣が存在し、それを迎え撃つ戦いを繰り返していた世界から、あなたはここへ流れ着いた。そして今も、アーセルトレイは異世界からの侵略者、ロアテラに狙われていると、あなたは理解している。",
  ].freeze

  YOUR_STORY_TABLE_ANOTHER_WORLD_5_6 = [
    "蒸気機関の世界:蒸気機関技術が異様に発達した世界から、あなたはここへ流れ着いた。アーセルトレイの技術レベルはそれらに匹敵するものだが、あなたからすると使い方の分からない不思議な技術だ。",
    "極東幻想の世界:我々の知る旧地球時代の日本、その国にて語られた鬼や妖怪が実在した世界からあなたはここへ流れ着いた。あなたからすれば、ステラナイトの強さはそれらをも超えるものかもしれない。",
    "異端生物の世界:バイオ技術か、交配の結果か、様々な生物と人類が融合した世界から、あなたはここへ辿り着いた。獣や鳥、海棲生物の特徴をあなたは備えている。",
    "異端科学の世界:人と機械の境界が曖昧な世界、個と全が曖昧な世界から、あなたはここへ流れ着いた。",
    "先進科学の世界:地球の科学がどこまでも真っ直ぐに育った世界から、あなたはここへ流れ着いた。美しく磨きあげられた街並み、道行く人の誰もが笑顔で、万人が幸せな世界から。",
    "草花の世界:植物と人が融合した世界から、あなたはここへ流れ着いた。あなたの身体は植物そのものかもしれないし、あるいは眼窩から花が咲いているかもしれない。",
  ].freeze

  YOUR_STORY_TABLE_ANOTHER_WORLD = [
    YOUR_STORY_TABLE_ANOTHER_WORLD_1_2,
    YOUR_STORY_TABLE_ANOTHER_WORLD_1_2,
    YOUR_STORY_TABLE_ANOTHER_WORLD_3_4,
    YOUR_STORY_TABLE_ANOTHER_WORLD_3_4,
    YOUR_STORY_TABLE_ANOTHER_WORLD_5_6,
    YOUR_STORY_TABLE_ANOTHER_WORLD_5_6,
  ].freeze
end
